---
kind: type
id: T:Autodesk.Revit.Exceptions.SchemaException
source: html/9f929b36-8215-444e-30fd-518c94fb6d29.htm
---
# Autodesk.Revit.Exceptions.SchemaException

The exception thrown when Revit cannot interpret a data structure described by a schema.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class SchemaException : InvalidOperationException
```